[SCREEN]
docinfo={background:1,mainfrm:false,type:SCREENI};
grpinfo={max_item_id:34};
itm1={id:1,name:Header,refID:2,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:true,x:2,y:3};
itm10={height:0,id:22,name:SXM_Loading,refID:107,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:false,width:0,x:63,y:121,zorder:17};
itm2={backcolor:0,background:933,ccp:751,ccpzorder:over,height:76,id:2,name:TEXT,type:BUTTON,useinlist:true,useintable:false,useintree:false,visible:true,width:507,x:63,y:124,zorder:1,txtfield:{backcolor:0,bidimode:left-to-right,content:Street name,font:3,height:36,highcolor:0,hlayout:left,linespacing:0,multiline:false,name:Street_name,type:TEXTFIELD,visible:true,vlayout:middle,width:223,wrapline:no-wrap,x:70,y:31},txtfield:{backcolor:0,bidimode:left-to-right,content:Bounds,font:3,height:36,highcolor:0,hlayout:left,linespacing:0,multiline:false,name:Bounds,type:TEXTFIELD,visible:true,vlayout:middle,width:223,wrapline:no-wrap,x:70,y:1},txtfield:{backcolor:0,bidimode:left-to-right,content:00.00,font:3,height:36,highcolor:0,hlayout:right,linespacing:0,multiline:false,name:number,type:TEXTFIELD,visible:true,vlayout:middle,width:96,wrapline:no-wrap,x:295,y:17,zorder:0},txtfield:{backcolor:0,bidimode:left-to-right,content:km,font:3,height:36,highcolor:0,hlayout:left,linespacing:0,multiline:false,name:km,type:TEXTFIELD,visible:true,vlayout:middle,width:45,wrapline:no-wrap,x:390,y:17},imgfield:{backcolor:0,height:50,img:403,layout:normal,name:Way_icon,type:IMAGEFIELD,visible:true,width:50,x:443,y:10,layout_param:{clipx:0,clipy:0}},imgfield:{backcolor:0,height:60,layout:normal,name:Icon_bounds,type:IMAGEFIELD,visible:true,width:60,x:5,y:5,layout_param:{clipx:0,clipy:0}}};
itm3={background:0,ccp:0,ccpzorder:over,height:304,id:3,layout:vertical,name:LIST,type:LIST,visible:true,width:507,x:63,y:124,zorder:2};
itm4={id:4,name:Home,refID:5,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:true,x:644,y:431,zorder:3};
itm5={backcolor:0,bar:241,downarrow:1178,height:302,id:7,name:Scrollbar,scaleslider:true,slider:240,type:SCROLLBAR,uparrow:1182,visible:true,width:55,x:577,y:124,zorder:6};
itm6={id:15,name:SiriusXM_info,refID:58,type:REFFUNCWIDGET,useinlist:false,useintable:false,useintree:false,visible:true,x:63,y:64,zorder:13};
itm7={backcolor:0,background:1034,ccp:779,ccpzorder:over,height:74,id:19,name:Around_me,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:159,x:644,y:162,zorder:14,txtfield:{backcolor:0,bidimode:left-to-right,content:Around me,font:19,height:70,highcolor:0,hlayout:center,linespacing:-5,multiline:true,name:Around_me,type:TEXTFIELD,visible:true,vlayout:top,width:144,wrapline:wrap-by-word,x:5,y:1}};
itm8={backcolor:0,background:1034,ccp:779,ccpzorder:over,height:74,id:20,name:On_road,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:159,x:644,y:238,zorder:15,txtfield:{backcolor:0,bidimode:left-to-right,content:On road,font:19,height:36,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:On_road,type:TEXTFIELD,visible:true,vlayout:middle,width:144,wrapline:no-wrap,x:5,y:17}};
itm9={backcolor:0,background:1034,ccp:779,ccpzorder:over,height:74,id:21,name:Refresh,type:BUTTON,useinlist:false,useintable:false,useintree:false,visible:true,width:159,x:644,y:314,zorder:16,txtfield:{backcolor:0,bidimode:left-to-right,content:Refresh,font:19,height:36,highcolor:0,hlayout:center,linespacing:0,multiline:false,name:Refresh,type:TEXTFIELD,visible:true,vlayout:middle,width:144,wrapline:no-wrap,x:5,y:17}};

